In [52]:
! pip install sqlalchemy pymysql pandas

Requirement already satisfied: sqlalchemy in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (2.0.31)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: pymysql in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (1.1.1)
Requirement already satisfied: pandas in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (2.2.2)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (from sqlalchemy) (3.0.3)
Requirement already satisfied: numpy>=1.26.0 in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [53]:
# Notebook Jupyter: Conectando ao MySQL com SQLAlchemy e lendo um SQL

## 1. Importando Bibliotecas


import pandas as pd
from sqlalchemy import create_engine

In [54]:
! pip install mysql

Requirement already satisfied: mysql in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (0.0.3)
Requirement already satisfied: mysqlclient in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (from mysql) (2.2.4)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [55]:
import pymysql

In [80]:
# Definir a variável global
df_alunos = None
df_professores = None
df_avaliacoes = None
df_diarioBordo = None




def test_connection():
    global df_alunos
    global df_professores
    global df_avaliacoes
    global df_diarioBordo
    try:
        connection = pymysql.connect(
            host='localhost',
            user='root',
            password='senai@123',
            database='schooltracker',
            port=3306
        )
        print("Conexão bem-sucedida!")

        # Realizar a consulta na tabela aluno
        query = "SELECT * FROM aluno"
        df_alunos = pd.read_sql(query, connection)

        # Realizar a consulta na tabela professor
        queryProfessor = 'SELECT * FROM professor'
        df_professores = pd.read_sql(queryProfessor, connection)
        
        # Realizar a consulta na tabela diariobordo
        queryDiarioBordo = 'SELECT * FROM diariobordo'
        df_diarioBordo = pd.read_sql(queryDiarioBordo, connection)

        # Realizar a consulta na tabela avaliacao
        queryAvaliacao = 'SELECT * FROM avaliacao'
        df_avaliacoes = pd.read_sql(queryAvaliacao, connection)

        # Fechar a conexão
        connection.close()
        
        print("Consulta realizada e DataFrame criado!")

    except Exception as e:
        print(f"Erro ao conectar ou consultar: {e}")

# Chamar a função para estabelecer a conexão e realizar a consulta
test_connection()

Conexão bem-sucedida!
Consulta realizada e DataFrame criado!

C:\Users\ead\AppData\Local\Temp\ipykernel_1940\3449001277.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_alunos = pd.read_sql(query, connection)
C:\Users\ead\AppData\Local\Temp\ipykernel_1940\3449001277.py:31: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_professores = pd.read_sql(queryProfessor, connection)
C:\Users\ead\AppData\Local\Temp\ipykernel_1940\3449001277.py:35: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_diarioBordo = pd.read_sql(queryDiarioBordo, connection)
C:\Users\ead\AppData\Local\Temp\ipykernel_1940\3449001277.py:39: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_avaliacoes = pd.read_sql(queryAvaliacao, connection)

In [57]:
# Exibir o DataFrame
if df_alunos is not None:
    print(df_alunos.head())
else:
    print("DataFrame não foi carregado.")

   id        ra               nome  tempoestudo  rendafamiliar
0   1   0034549          Ana Silva         11.0         3200.0
1   2   0034547       Carlos Souza          6.0         3500.0
2   3  20230001  Fernanda Oliveira         13.0         4700.0
3   4  20230002     Gabriel Santos          7.0         2900.0
4   5  20230003    Juliana Pereira          8.0         3100.0

In [58]:
df_alunos.ra.head()

0     0034549
1     0034547
2    20230001
3    20230002
4    20230003
Name: ra, dtype: object

In [59]:
df_alunos.id.head()

0    1
1    2
2    3
3    4
4    5
Name: id, dtype: int64

In [60]:
df_alunos.shape

(52, 5)

In [61]:
df_professores.nome.head()

0     Ana Oliveira
1     Carlos Silva
2    Fernanda Lima
3      João Santos
4    Mariana Costa
Name: nome, dtype: object

In [62]:
df_avaliacoes.n1.head()

0    8
1    5
2    9
3    4
4    7
Name: n1, dtype: int64

## Quais bibliotecas um cientista de dados utiliza ?

- Pandas
- NumPy
- Fundamentos de IA (Scikit-Learn)

- Material Didático
- Pandas e NumPy(Notebook)
- Scikit-Learn

### Pandas : Ciência de dados
### Scikit-Learn : Elaboração de modelos de IA
### NumPy : Matemática

## 05/08/2024

- Carregar Dados (ok)
- Salvar um dataframe

In [63]:
csv_filename = 'alunos.csv'
df_alunos.to_csv(csv_filename, index=False)

In [64]:
df_professores.to_json('professores.json', index=False)

In [65]:
df_avaliacoes.to_excel('avaliacoes.xlsx', index=False)

In [66]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\senaiprojects\fabriciosemanadc\.venv\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

### Um novo DataFrame

In [67]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [68]:
df_tempo_renda = df_alunos[['nome', 'tempoestudo', 'rendafamiliar']]

df_tempo_renda.head()

                nome  tempoestudo  rendafamiliar
0          Ana Silva         11.0         3200.0
1       Carlos Souza          6.0         3500.0
2  Fernanda Oliveira         13.0         4700.0
3     Gabriel Santos          7.0         2900.0
4    Juliana Pereira          8.0         3100.0

### Tipos

In [69]:
print(type(df_tempo_renda))

<class 'pandas.core.frame.DataFrame'>

### Exercício: Crie um recurso para mostrar apenas uma coluna. Mostre qual o tipo desse recurso

In [70]:
serie_tempo_renda = df_tempo_renda['rendafamiliar'].head()

print(type(serie_tempo_renda))

<class 'pandas.core.series.Series'>

### Revisando Funções Básicas

#### 06/08/2024

### Exercício 01 - Retorne o dataframe da última aula com as duas primeiras linhas com amostra

In [71]:
df_tempo_renda.head(2)

           nome  tempoestudo  rendafamiliar
0     Ana Silva         11.0         3200.0
1  Carlos Souza          6.0         3500.0

### Exercício 02 - Agora retorne as duas últimas linhas da amostra

In [72]:
df_tempo_renda.tail(2)

                nome  tempoestudo  rendafamiliar
50     Kalebe Junior          6.0         3200.0
51  Fabas dos Santos          5.0         3000.0

### Exercício 03 - retorne uma tupla com numero de linhas e colunas

In [73]:
df_tempo_renda.shape

(52, 3)

### Exercício 04 - retorne as informações gerais do dataframe

In [74]:
df_tempo_renda.info()

qtde = len(df_tempo_renda)
if qtde <= 76:
    print(f'quantidade: {qtde} dentro do ideal')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   nome           52 non-null     object
 1   tempoestudo    40 non-null     float64
 2   rendafamiliar  40 non-null     float64
dtypes: float64(2), object(1)
memory usage: 1.3+ KB
quantidade: 52 dentro do ideal

### Exercício 05 - Retorne as colunas

In [75]:
df_tempo_renda.columns

Index(['nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

### Exercício 06 - Retorne as informações apenas da coluna rendafamilia

In [76]:
df_tempo_renda['rendafamiliar'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 52 entries, 0 to 51
Series name: rendafamiliar
Non-Null Count  Dtype
--------------  -----
40 non-null     float64
dtypes: float64(1)
memory usage: 548.0 bytes

### Exercício 07 - Mostre os tipos com dtypes

In [84]:
df_alunos.describe()

              id  tempoestudo  rendafamiliar
count  52.000000    40.000000      40.000000
mean   26.884615     7.050000    3365.000000
std    15.571031     2.952183     724.144057
min     1.000000     1.000000    2300.000000
25%    13.750000     5.000000    2900.000000
50%    26.500000     7.000000    3200.000000
75%    40.250000     9.000000    3525.000000
max    53.000000    13.000000    5000.000000

### Exercício 08 - Crie um dataframe da tabela diário de bordo

In [81]:

df_diarioBordo.head()

,id,texto,datahora,fk_aluno_id
0,1,"Primeiro dia de aula, tudo novo e empolgante!",2024-08-01 08:00:00,1
1,2,Aulas de matemática foram desafiadoras.,2024-08-01 10:00:00,2
2,3,Conheci alguns colegas e eles parecem legais.,2024-08-01 13:00:00,3
3,4,O laboratório de ciências foi interessante.,2024-08-01 15:00:00,4
4,5,Reunião do clube de leitura foi animada.,2024-08-02 09:00:00,5

In [86]:
print(f' Quantidade de Linhas e colunas: {df_diarioBordo.shape}')

 Quantidade de Linhas e colunas: (30, 4)

In [87]:
print(f' Colunas existentes: {df_diarioBordo.columns}')

 Colunas existentes: Index(['id', 'texto', 'datahora', 'fk_aluno_id'], dtype='object')

In [106]:
df_diarioBordo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           30 non-null     int64
 1   texto        30 non-null     object
 2   datahora     30 non-null     datetime64[ns]
 3   fk_aluno_id  30 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 1.1+ KB

In [90]:
df_avaliacoes.head()

   id  n1  n2  n3  n4  fk_aluno_id fk_professor_id
0   1   8   7   9   6            1            None
1   2   5   6   7   8            2            None
2   3   9   8  10   9            3            None
3   4   4   5   6   7            4            None
4   5   7   7   7   7            5            None

In [101]:
df_avaliacoes.drop(columns='fk_professor_id').head()

   id  n1  n2  n3  n4  fk_aluno_id
0   1   8   7   9   6            1
1   2   5   6   7   8            2
2   3   9   8  10   9            3
3   4   4   5   6   7            4
4   5   7   7   7   7            5

In [96]:
df_avaliacoes.count()

id                 45
n1                 45
n2                 45
n3                 45
n4                 45
fk_aluno_id        45
fk_professor_id     0
dtype: int64

In [146]:
df_alunos_nome = df_alunos[['id','nome', 'ra']]

df_avaliacao2 =  pd.merge(df_alunos_nome,df_avaliacoes, how='inner', left_on='id', right_on='fk_aluno_id').drop(columns=['fk_professor_id', 'fk_aluno_id']).head()

df_avaliacao2

   id_x          nome       ra  id_y  n1  n2  n3  n4
0     1     Ana Silva  0034549     1   8   7   9   6
1     1     Ana Silva  0034549     6   7   8   6   9
2     1     Ana Silva  0034549    26   6   8   6   7
3     2  Carlos Souza  0034547     2   5   6   7   8
4     2  Carlos Souza  0034547     7   6   7   7   8

In [147]:
df_avaliacao2.drop_duplicates(subset='id_x').head()

   id_x          nome       ra  id_y  n1  n2  n3  n4
0     1     Ana Silva  0034549     1   8   7   9   6
3     2  Carlos Souza  0034547     2   5   6   7   8